src/Documents/РеестрСЗВ_6_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РеестрСЗВ_6_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтраховыеВзносыПереданныеВПФР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЗастрахованныхЛиц</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЗастрахованныхЛицДляПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведенийСЗВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСведенийСЗВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируемыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДляПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>68</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПринятВПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСформирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресДляИнформирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойНомерПФР</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоСтраховая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УплаченоСтраховая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоНакопительная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УплаченоНакопительная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначисленоСтраховая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоначисленоНакопительная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДляИнформированияПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодыСтажаСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоУплаченоНакопительная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоУплаченоСтраховая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксУплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксСтаж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксНачисления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаписиОСтаже</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыСведенийСЗВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыСведенийСЗВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИСХОДНАЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОРРЕКТИРУЮЩАЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОТМЕНЯЮЩАЯ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РеестрСЗВ_6_2/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверка заполнения документа
// 
// Параметры:
// 	ПроверяемыеРеквизиты - Строка - .
// 	НеПроверяемыеРеквизиты - Строка - .
// 	Отказ - Булево - .
Процедура ПроверкаЗаполненияДокумента(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты, Отказ) Экспорт

	ОкончаниеПериода = УчетСтраховыхВзносов.ОкончаниеОтчетногоПериодаПерсУчета(?(ТипСведенийСЗВ
		= Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ, ОтчетныйПериод, КорректируемыйПериод));

	ВыборкаЗаписиОСтаже = СформироватьЗапросПоСтажуДляПроверкиЗаполнения().Выбрать();

	Если ЗаписиОСтаже.Количество() > 200 Тогда
		ТекстОшибки = НСтр("ru = 'В документе должно быть не более 200 сотрудников'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
	КонецЕсли;

	Пока ВыборкаЗаписиОСтаже.СледующийПоЗначениюПоля("НомерСтрокиСотрудник") Цикл

		Если ЗначениеЗаполнено(ВыборкаЗаписиОСтаже.Сотрудник) Тогда
			Если ВыборкаЗаписиОСтаже.КонфликтующаяСтрока <> Null Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
					"ru = 'Информация о сотруднике %2 была введена в документе ранее'"),
					ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, ВыборкаЗаписиОСтаже.СотрудникНаименование);
				СообщитьОбОшибкеВСтроке(ТекстОшибки, "Сотрудник", ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, Отказ);
			ИначеЕсли ВыборкаЗаписиОСтаже.КонфликтующаяСтрокаСтраховойНомер <> Null Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
					"ru = 'Сотрудник %2: информация о сотруднике с таким же страховым номером была введена в документе ранее'"),
					ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, ВыборкаЗаписиОСтаже.СотрудникНаименование);
				СообщитьОбОшибкеВСтроке(ТекстОшибки, "Сотрудник", ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, Отказ);
			КонецЕсли;

			НомерСтроки = 0;

			Если ЗначениеЗаполнено(ВыборкаЗаписиОСтаже.НомерСтрокиСтаж) Тогда

				Пока ВыборкаЗаписиОСтаже.СледующийПоЗначениюПоля("НомерСтрокиСтаж") Цикл

					НомерСтроки = НомерСтроки + 1;
					
					// ПРОВЕРКА КОРРЕКТНОГО ЗАПОЛНЕНИЯ ДАТ НАЧАЛА И ОКОНЧАНИЯ ПЕРИОДА

					// Проверка заполнения реквизитов "ДатаНачалаПериода" и "ДатаОкончанияПериода" 
					Если ЗначениеЗаполнено(ВыборкаЗаписиОСтаже.ДатаНачалаПериода) И ЗначениеЗаполнено(
						ВыборкаЗаписиОСтаже.ДатаОкончанияПериода) Тогда
									
						// Дата начала периода не должна быть ранее начала периода
						Если ВыборкаЗаписиОСтаже.ДатаНачалаПериода < ?(ТипСведенийСЗВ
							= Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ, ОтчетныйПериод, КорректируемыйПериод) Тогда
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
								"ru = 'Сотрудник %2: дата начала периода должна быть не ранее начала периода'"),
								НомерСтроки, ВыборкаЗаписиОСтаже.СотрудникНаименование);
							СообщитьОбОшибкеВСтроке(ТекстОшибки, "ПериодыСтажаСтрока",
								ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, Отказ);

						КонецЕсли;
						
						// Дата окончания периода не должна быть позднее окончания периода
						Если ВыборкаЗаписиОСтаже.ДатаОкончанияПериода > ОкончаниеПериода Тогда
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
								"ru = 'Сотрудник %2: дата окончания периода должна быть не позднее окончания периода'"),
								НомерСтроки, ВыборкаЗаписиОСтаже.СотрудникНаименование);
							СообщитьОбОшибкеВСтроке(ТекстОшибки, "ПериодыСтажаСтрока",
								ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, Отказ);
						КонецЕсли;	 
						
						// Начало периода не должно быть позже окончания периода 
						Если ВыборкаЗаписиОСтаже.ДатаНачалаПериода > ВыборкаЗаписиОСтаже.ДатаОкончанияПериода Тогда
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
								"ru = 'Сотрудник %2: дата начала периода не должна превышать дату окончания периода'"),
								НомерСтроки, ВыборкаЗаписиОСтаже.СотрудникНаименование);
							СообщитьОбОшибкеВСтроке(ТекстОшибки, "ПериодыСтажаСтрока",
								ВыборкаЗаписиОСтаже.НомерСтрокиСотрудник, Отказ);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросПоСтажуДляПроверкиЗаполнения()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаЗаписиОСтаже", ЗаписиОСтаже);
	Запрос.УстановитьПараметр("ТаблицаСотрудники", Сотрудники);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСотрудники.НомерСтроки,
	               |	ТаблицаСотрудники.Сотрудник,
				   |	ТаблицаСотрудники.Фамилия,
				   |	ТаблицаСотрудники.Имя,
	               |	ТаблицаСотрудники.АдресДляИнформирования,
	               |	ТаблицаСотрудники.СтраховойНомерПФР
	               |ПОМЕСТИТЬ ВТСотрудники
	               |ИЗ
	               |	&ТаблицаСотрудники КАК ТаблицаСотрудники";
				   
	Запрос.Выполнить();
	
	НачалоПериода = НачалоМесяца(ОтчетныйПериод);
	ОкончаниеПериода = УчетСтраховыхВзносов.ОкончаниеОтчетногоПериодаПерсУчета(ОтчетныйПериод);
	
	УчетСтраховыхВзносов.СформироватьТаблицуВТФизическиеЛицаРаботавшиеВОрганизации(Запрос.МенеджерВременныхТаблиц,
		Организация, НачалоПериода, ОкончаниеПериода);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиДокумента.НомерСтроки,
	               |	СотрудникиДокумента.Сотрудник КАК Сотрудник,
	               |	СотрудникиДокумента.Фамилия,
	               |	СотрудникиДокумента.Имя,
	               |	СотрудникиДокумента.Сотрудник.Наименование КАК СотрудникНаименование,
	               |	СотрудникиДокумента.АдресДляИнформирования,
	               |	СотрудникиДокумента.СтраховойНомерПФР,
	               |	МИНИМУМ(ДублиСтрок.НомерСтроки) КАК КонфликтующаяСтрока,
	               |	ВЫБОР
	               |		КОГДА АктуальныеСотрудники.ФизическоеЛицо ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК СотрудникРаботаетВОрганизации,
	               |	МИНИМУМ(ДублиСтрокСтраховыеНомера.НомерСтроки) КАК КонфликтующаяСтрокаСтраховойНомер
	               |ПОМЕСТИТЬ ВТСотрудникиДокумента
	               |ИЗ
	               |	ВТСотрудники КАК СотрудникиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ДублиСтрок
	               |		ПО СотрудникиДокумента.НомерСтроки > ДублиСтрок.НомерСтроки
	               |			И СотрудникиДокумента.Сотрудник = ДублиСтрок.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаРаботавшиеВОрганизации КАК АктуальныеСотрудники
	               |		ПО СотрудникиДокумента.Сотрудник = АктуальныеСотрудники.ФизическоеЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ДублиСтрокСтраховыеНомера
	               |		ПО СотрудникиДокумента.НомерСтроки > ДублиСтрокСтраховыеНомера.НомерСтроки
	               |			И СотрудникиДокумента.СтраховойНомерПФР = ДублиСтрокСтраховыеНомера.СтраховойНомерПФР
	               |			И СотрудникиДокумента.Сотрудник <> ДублиСтрокСтраховыеНомера.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СотрудникиДокумента.НомерСтроки,
	               |	СотрудникиДокумента.Сотрудник,
	               |	СотрудникиДокумента.Фамилия,
	               |	СотрудникиДокумента.Имя,
	               |	СотрудникиДокумента.Сотрудник.Наименование,
	               |	СотрудникиДокумента.АдресДляИнформирования,
	               |	СотрудникиДокумента.СтраховойНомерПФР,
	               |	ВЫБОР
	               |		КОГДА АктуальныеСотрудники.ФизическоеЛицо ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаписиОСтаже.Сотрудник,
	               |	ТаблицаЗаписиОСтаже.НомерСтроки,
	               |	ТаблицаЗаписиОСтаже.ДатаНачалаПериода,
	               |	ТаблицаЗаписиОСтаже.ДатаОкончанияПериода
	               |ПОМЕСТИТЬ ВТЗаписиОСтаже
	               |ИЗ
	               |	&ТаблицаЗаписиОСтаже КАК ТаблицаЗаписиОСтаже
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗаписиОСтаже.НомерСтроки КАК НомерСтроки,
	               |	ВТЗаписиОСтаже.Сотрудник,
	               |	ВТЗаписиОСтаже.ДатаНачалаПериода,
	               |	ВТЗаписиОСтаже.ДатаОкончанияПериода,
	               |	ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТрудаПФР.ПустаяСсылка) КАК ОсобыеУсловияТруда,
	               |	ЗНАЧЕНИЕ(Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ПустаяСсылка) КАК КодПозицииСписка,
	               |	ЗНАЧЕНИЕ(Справочник.ОснованияИсчисляемогоСтраховогоСтажа.ПустаяСсылка) КАК ОснованиеИсчисляемогоСтажа,
	               |	0 КАК ПервыйПараметрИсчисляемогоСтажа,
	               |	0 КАК ВторойПараметрИсчисляемогоСтажа,
	               |	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа.ПустаяСсылка) КАК ТретийПараметрИсчисляемогоСтажа,
	               |	ЗНАЧЕНИЕ(Справочник.ОснованияДосрочногоНазначенияПенсии.ПустаяСсылка) КАК ОснованиеВыслугиЛет,
	               |	0 КАК ПервыйПараметрВыслугиЛет,
	               |	0 КАК ВторойПараметрВыслугиЛет,
	               |	0 КАК ТретийПараметрВыслугиЛет,
	               |	ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловияПФР.ПустаяССылка) КАК ТерриториальныеУсловия,
	               |	0 КАК ПараметрТерриториальныхУсловий,
	               |	ЛОЖЬ КАК ФиксСтаж
	               |ПОМЕСТИТЬ ВТТаблицаСтажа
	               |ИЗ
	               |	ВТЗаписиОСтаже КАК ВТЗаписиОСтаже
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВТЗаписиОСтаже.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСтажа.НомерСтроки КАК НомерСтрокиСтаж,
	               |	СотрудникиДокумента.НомерСтроки КАК НомерСтрокиСотрудник,
	               |	СотрудникиДокумента.Сотрудник КАК Сотрудник,
	               |	СотрудникиДокумента.СотрудникНаименование,
	               |	СотрудникиДокумента.АдресДляИнформирования,
	               |	СотрудникиДокумента.СтраховойНомерПФР,
	               |	СотрудникиДокумента.СотрудникРаботаетВОрганизации,
	               |	СотрудникиДокумента.КонфликтующаяСтрока,
	               |	СотрудникиДокумента.Фамилия,
	               |	СотрудникиДокумента.Имя,
	               |	ТаблицаСтажа.ДатаНачалаПериода,
	               |	ТаблицаСтажа.ДатаОкончанияПериода,
	               |	СотрудникиДокумента.КонфликтующаяСтрокаСтраховойНомер
	               |ИЗ
	               |	ВТСотрудникиДокумента КАК СотрудникиДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаСтажа КАК ТаблицаСтажа
	               |		ПО СотрудникиДокумента.Сотрудник = ТаблицаСтажа.Сотрудник
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтрокиСотрудник,
	               |	НомерСтрокиСтаж";
	
	Возврат Запрос.Выполнить();
  
КонецФункции	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
КонецПроцедуры

Процедура СообщитьОбОшибкеВСтроке(ТекстСообщения, Поле, НомерСтроки, Отказ)
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, СтрШаблон(
		"Объект.Сотрудники[%1].%2", Поле, XMLСтрока(НомерСтроки - 1)), , Отказ);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
